aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_riic_rx/src/targets/rx65n/r_riic_rx65n.c
/***********************************************************************************************************************
 * Function Name: riic_mcu_hardware_lock
 * Description  : Attempt to acquire the lock that has been sent in.
 * Arguments    : uint8_t channel
 * Return Value : true                   ; Successful operation
 *              : false                  ; error operation
 **********************************************************************************************************************/
bool riic_mcu_hardware_lock (uint8_t channel)
{
    bool chk = false;

    switch (channel)
    {
    #if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 :
            chk = R_BSP_HardwareLock(BSP_LOCK_RIIC0);
        break;
    #endif

    #if (1U == RIIC_CFG_CH1_INCLUDED)
        case 0x01 :
            chk = R_BSP_HardwareLock(BSP_LOCK_RIIC1);
        break;
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
        case 0x02:
            chk = R_BSP_HardwareLock(BSP_LOCK_RIIC2);
        break;
    #endif

        default :

            /* Do Nothing */
        break;
    }
    return chk;
} /* End of function riic_mcu_hardware_lock() */

/***********************************************************************************************************************
 * Function Name: riic_mcu_hardware_unlock
 * Description  : Release hold on lock.
 * Arguments    : uint8_t channel
 * Return Value : none
 **********************************************************************************************************************/
void riic_mcu_hardware_unlock (uint8_t channel)
{
    switch (channel)
    {
    #if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 :
            R_BSP_HardwareUnlock(BSP_LOCK_RIIC0);
        break;
    #endif

    #if (1U == RIIC_CFG_CH1_INCLUDED)
        case 0x01 :
            R_BSP_HardwareUnlock(BSP_LOCK_RIIC1);
        break;
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
        case 0x02:
            R_BSP_HardwareUnlock(BSP_LOCK_RIIC2);
        break;
    #endif

        default :

            /* Do Nothing */
        break;
    }
} /* End of function riic_mcu_hardware_unlock() */

/***********************************************************************************************************************
 * Function Name: riic_mcu_power_on
 * Description  : Turns on power to a RIIC channel.
 * Arguments    : uint8_t channel
 * Return Value : none
 **********************************************************************************************************************/
void riic_mcu_power_on (uint8_t channel)
{
    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Enable selected RIIC Channel. */
    switch (channel)
    {
    #if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 :

            /* Bring module out of stop state. */
            MSTP(RIIC0) = 0U;
        break;
    #endif

    #if (1U == RIIC_CFG_CH1_INCLUDED)
        case 0x01 :

            /* Bring module out of stop state. */
            MSTP(RIIC1) = 0U;
        break;
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
        case 0x02:

            /* Bring module out of stop state. */
            MSTP(RIIC2) = 0U;
        break;
    #endif

        default :

            /* Should never get here. Valid channel number is checked above. */
        break;
    }

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of function riic_mcu_power_on() */

/***********************************************************************************************************************
 * Function Name: riic_mcu_power_off
 * Description  : Turns off power to a RIIC channel.
 * Arguments    : uint8_t channel
 * Return Value : none
 **********************************************************************************************************************/
void riic_mcu_power_off (uint8_t channel)
{
    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

    /* Disable selected CMT Channel. */
    switch (channel)
    {
    #if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 :

            /* Put module in stop state. */
            MSTP(RIIC0) = 1U;
        break;
    #endif

    #if (1U == RIIC_CFG_CH1_INCLUDED)
        case 0x01 :

            /* Put module in stop state. */
            MSTP(RIIC1) = 1U;
        break;
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
        case 0x02:

            /* Put module in stop state. */
            MSTP(RIIC2) = 1U;
        break;
    #endif

        default :

            /* Should never get here. Valid channel number is checked above. */
        break;
    }

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of function riic_mcu_power_off() */

/***********************************************************************************************************************
 * Function Name: riic_mcu_int_icier_setting
 * Description  : Time out interrupt enable bit setting.
 * Arguments    : uint8_t channel
 *              : uint8_t New_icier       ; New ICIER value
 * Return Value : None
 **********************************************************************************************************************/
void riic_mcu_int_icier_setting (uint8_t channel, uint8_t New_icier)
{
    volatile uint8_t uctmp = 0x00;

    /* Channel number? */
    switch (channel)
    {
    #if (1U == RIIC_CFG_CH0_INCLUDED)
        case 0x00 : /* Channel 0 */
        #if (1U == RIIC_CFG_CH0_TMO_ENABLE)
            RIIC0.ICIER.BYTE = (New_icier | RIIC_ICIER_TMO);
            uctmp = RIIC0.ICIER.BYTE; /* Reads ICIER. */
        #else
            RIIC0.ICIER.BYTE = New_icier;
            uctmp = RIIC0.ICIER.BYTE; /* Reads ICIER. */
        #endif
        break;
    #endif

    #if (1U == RIIC_CFG_CH1_INCLUDED)
        case 0x01 : /* Channel 1 */
        #if (1U == RIIC_CFG_CH1_TMO_ENABLE)
            RIIC1.ICIER.BYTE = (New_icier | RIIC_ICIER_TMO);
            uctmp = RIIC1.ICIER.BYTE; /* Reads ICIER. */
        #else
            RIIC1.ICIER.BYTE = New_icier;
            uctmp = RIIC1.ICIER.BYTE; /* Reads ICIER. */
        #endif
        break;
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
        case 0x02: /* Channel 2 */
        #if (1U == RIIC_CFG_CH2_TMO_ENABLE)
            RIIC2.ICIER.BYTE = (New_icier | RIIC_ICIER_TMO);
            uctmp = RIIC2.ICIER.BYTE; /* Reads ICIER. */
        #else
            RIIC2.ICIER.BYTE = New_icier;
            uctmp = RIIC2.ICIER.BYTE; /* Reads ICIER. */
        #endif
        break;
    #endif

        default :

