aws/amazon-freertos/vendors/renesas/FIT/RDP_v1.15_modified/r_riic_rx/src/targets/rx65n/r_riic_rx65n.c
/***********************************************************************************************************************
 * Function Name: riic2_txi_isr
 * Description  : Interrupt TXI handler for channel 2.
 *                Types of interrupt requests transmission data empty.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(riic2_txi_isr, VECT(RIIC2, TXI2))
R_ATTRIB_STATIC_INTERRUPT void riic2_txi_isr(void)
{
    riic2_txi_sub();
} /* End of function riic2_txi_isr() */

/***********************************************************************************************************************
 * Function Name: riic2_rxi_isr
 * Description  : Interrupt RXI handler for channel 2.
 *                Types of interrupt requests reception end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_PRAGMA_STATIC_INTERRUPT(riic2_rxi_isr, VECT(RIIC2, RXI2))
R_ATTRIB_STATIC_INTERRUPT void riic2_rxi_isr(void)
{
    riic2_rxi_sub();
} /* End of function riic2_rxi_isr() */

/***********************************************************************************************************************
 * Function Name: riic2_tei_isr
 * Description  : Interrupt TEI handler for channel 2.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic2_tei_isr(void * vect)
{
    riic2_tei_sub();
} /* End of function riic2_tei_isr() */
    #endif

#endif /* defined(BSP_MCU_RX65N) */

